In [2]:
import pandas as pd
import sqlite3 as sql

In [3]:
conn = sql.connect('database.sqlite')

In [4]:
pd.read_sql_query('select * from sqlite_master', conn)

,type,name,tbl_name,rootpage,sql
0,table,Salaries,Salaries,2,CREATE TABLE Salaries (\n Id INTEGER PRIMAR...
1,index,salaries_year_idx,Salaries,16566,CREATE INDEX salaries_year_idx ON Salaries (Year)

In [6]:
pd.read_sql_query('select * from salaries', conn)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184.25,,9999999.00,567595.43,2011,,San Francisco,
1,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,,335279.91,335279.91,2011,,San Francisco,
2,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.71,198306.9,,332343.61,332343.61,2011,,San Francisco,
3,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737,182234.59,,326373.19,326373.19,2011,,San Francisco,
4,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602,8601,189082.74,,316285.74,316285.74,2011,,San Francisco,
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148648,148650,Roy I Tillery,Custodian,0,0,0,0,0.00,0.00,2014,,San Francisco,PT
148649,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148650,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148651,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148652,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618.13,0,-618.13,-618.13,2014,,San Francisco,PT

In [7]:
def sql_query(q):
    return pd.read_sql_query(q,conn)

# Question No.1
### 1. What is the average TotalPayBenefits for each JobTitle? exclude ('Not Provided', 'Not provided')

In [8]:
q = '''select jobtitle, ROUND(AVG(TotalPayBenefits), 2) as 'Average (TotalPayBenefits)' from salaries 
    where jobtitle not in ('Not Provided', 'Not provided') 
    group by jobtitle order by 2 desc'''

sql_query(q)

,JobTitle,Average (TotalPayBenefits)
0,Chief Investment Officer,436224.36
1,Chief of Police,411732.27
2,"Chief, Fire Department",408865.33
3,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,399211.28
4,"Gen Mgr, Public Trnsp Dept",380696.44
...,...,...
2153,SPECIAL ASSISTANT XIV,673.80
2154,"BOARD/COMMISSION MEMBER, GROUP III",638.79
2155,"BdComm Mbr, Grp2,M=$25/Mtg",475.05
2156,"BOARD/COMMISSION MEMBER, GROUP II",296.51
2157,PUBLIC SAFETY COMMUNICATIONS TECHNICIAN,149.51

# Question No.2
### Show The JobTitle and Overtime Pay for All Employees With Overtime Pay greater than 50000

In [9]:
q = ''' select jobtitle, overtimepay from salaries
    where overtimepay > 50000
    and jobtitle not in ('Not Provided', 'Not provided')
       order by 2 desc
'''

sql_query(q)

                            JobTitle  OvertimePay
0       Lieutenant, Fire Suppression    220909.48
1                     Deputy Sheriff    196689.18
2          EMT/Paramedic/Firefighter    192424.49
3                     Deputy Sheriff    173547.73
4                     Deputy Sheriff    173178.23
...                              ...          ...
2159                Police Officer 3     50060.80
2160                      Sergeant 3     50055.88
2161  Battalion Chief, Fire Suppress     50039.97
2162                     FIREFIGHTER     50019.79
2163                     Firefighter     50018.08

[2164 rows x 2 columns]

# Question No.3
### What is the total number of unique employees? exclude ('Not Provided', 'Not provided')

In [10]:
q = ''' select count(distinct employeename) as Unique_Employees from salaries
    where employeename not in ('Not Provided', 'Not provided')
'''

sql_query(q)

   Unique_Employees
0            110808

# Question No.4
### Show The Top 10 highest Paid Employees

In [11]:
q = ''' select employeename as Employee, totalpay as Pay from salaries
    order by 2 desc limit 10
'''

sql_query(q)

               Employee         Pay
0        NATHANIEL FORD  9999999.00
1           David Shinn   471952.64
2            Amy P Hart   390111.98
3        Gary Altenberg   362844.66
4         John Goldberg   350403.41
5           Samson  Lai   347102.32
6       Ellen G Moffatt   344187.46
7  William J Coaker Jr.   339653.70
8        Gregory P Suhr   339282.07
9     Frederick Binkley   337204.86

# Question No.5
### Show All Employees Ordered By Their TotalPay Benefits In Descending Order

In [12]:
q = ''' select employeename as Employee, totalpaybenefits as Pay_Benefit from salaries
    where employeename not in ('Not Provided', 'Not provided')
    order by 2 desc
'''

sql_query(q)

                    Employee  Pay_Benefit
0             NATHANIEL FORD    567595.43
1                David Shinn    510732.68
2                 Amy P Hart    479652.21
3       William J Coaker Jr.    436224.36
4             Gregory P Suhr    425815.28
...                      ...          ...
148642         Roy I Tillery         0.00
148643      Timothy E Gibson        -2.73
148644        Mark E Laherty        -8.20
148645         David P Kucia       -33.89
148646             Joe Lopez      -618.13

[148647 rows x 2 columns]

In [13]:
conn.close()